Autodesk.Revit.DB.MEPSystem.DivideSystem(Autodesk.Revit.DB.Document)
Divide the phyisical networks in the system and create a new system for each network.
Remarks:
This function only works for Hvac and Piping system.
ADoc:
The document.
Returns:
The id of new created systems.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The system is not dividable.
Since:
2014